[
  {
    "soru": "What are your strengths?",
    "cevap": "I am proof at C and python and  i am hardworking also i can handle all stress moments"
  },
  {
    "soru": "What is your greatest achievement?",
    "cevap": "I have completed a project in a short time"
  },
  {
    "soru": "Why do you want to work here?",
    "cevap": "I want to work here because i like this company"
  },
  {
    "soru": "What are your salary expectations?",
    "cevap": "I expect a salary of 10000 TL"
  },
  {
    "soru": "How do you handle stress and pressure?",
    "cevap": "I handle stress and pressure by taking deep breaths and staying calm"
  },
  {
    "soru": "What is your greatest weakness?",
    "cevap": "I am not good at C++"
  },
  {
    "soru": "What are your weaknesses?",
    "cevap": "I am not good at C++ and i am not good at math"
  },
  {
    "soru": "Why should we hire you?",
    "cevap": "I am hardworking and i can handle all stress moments"
  },
  {
    "soru": "Where do you see yourself in five years?",
    "cevap": "I see myself as a senior developer in five years"
  },
  {
    "soru": "What motivates you?",
    "cevap": "I am motivated by challenges and learning new things"
  },
  {
    "soru": "How do you prioritize your work?",
    "cevap": "I prioritize my work by making a to-do list and focusing on the most important tasks first"
  },
  {
    "soru": "How do you handle conflict with a coworker?",
    "cevap": "I handle conflict with a coworker by talking to them and trying to find a solution together"
  },
  {
    "soru": "What is your management style?",
    "cevap": "My management style is to be supportive and to give my team the resources they need to succeed"
  },
  {
    "soru": "How do you handle failure?",
    "cevap": "I handle failure by learning from my mistakes and trying again"
  },
  {
    "soru": "What is your leadership style?",
    "cevap": "My leadership style is to be supportive and to give my team the resources they need to succeed"
  },
  {
    "soru": "How do you handle criticism?",
    "cevap": "I handle criticism by listening to it and trying to learn from it"
  },
  {
    "soru": "What are your career goals?",
    "cevap": "My career goals are to become a senior developer and to work on interesting projects"
  },
  {
    "soru": "How do you stay organized?",
    "cevap": "I stay organized by using a planner and keeping my workspace tidy"
  },
  {
    "soru": "What is your work style?",
    "cevap": "My work style is to be focused and to work hard"
  },
  {
    "soru": "How do you handle change?",
    "cevap": "I handle change by being flexible and adapting to new situations"
  },
  {
    "soru": "What is your problem-solving process?",
    "cevap": "My problem-solving process is to identify the problem, brainstorm solutions, and choose the best one"
  },
  {
    "soru": "How do you handle tight deadlines?",
    "cevap": "I handle tight deadlines by staying focused and working efficiently"
  },
  {
    "soru": "What is your communication style?",
    "cevap": "My communication style is to be clear and concise"
  },
  {
    "soru": "How do you handle difficult customers?",
    "cevap": "I handle difficult customers by listening to their concerns and trying to find a solution"
  },
  {
    "soru": "What is your approach to teamwork?",
    "cevap": "My approach to teamwork is to be supportive and to communicate openly"
  },
  {
    "soru": "How do you handle multiple tasks at once?",
    "cevap": "I handle multiple tasks at once by prioritizing and staying organized"
  },
  {
    "soru": "Tell me about a time you showed leadership.",
    "cevap": "I dont have any experienct, I am not innovative"
  },
  {
    "soru": "Can you tell me about yourself?",
    "cevap": "i am laçin temel i am not hardworking person"
  },
  {
    "soru": "Why do you want this job?",
    "cevap": "because its for me"
  },
  {
    "soru": "Why do you want this job?",
    "cevap": "Because it is my dream job and i feel that position super suiatable for me",
    "rating": 0,
    "timestamp": "2025-05-22 03:32:11.924534"
  },
  {
    "soru": "How do you stay up-to-date with industry trends?",
    "cevap": "I follow tech blogs, attend webinars, and take online courses regularly to stay informed."
  },
  {
    "soru": "Describe your ideal work environment.",
    "cevap": "My ideal work environment is collaborative, transparent, and encourages innovation."
  },
  {
    "soru": "What do you know about our company?",
    "cevap": "I know that your company values innovation and has a strong reputation in the AI sector."
  },
  {
    "soru": "Tell me about a time you made a mistake.",
    "cevap": "Once I misjudged a project deadline, but I communicated early and took steps to deliver on time."
  },
  {
    "soru": "How do you ensure quality in your work?",
    "cevap": "I double-check my work, seek feedback, and use checklists to ensure high quality."
  },
  {
    "soru": "What is your biggest professional failure?",
    "cevap": "In one internship, I failed to ask for help early. I learned to communicate better as a result."
  },
  {
    "soru": "What does success mean to you?",
    "cevap": "Success means achieving goals while growing personally and professionally along the way."
  },
  {
    "soru": "How would your coworkers describe you?",
    "cevap": "They would say I’m reliable, easy to work with, and always willing to help others."
  },
  {
    "soru": "What are you passionate about?",
    "cevap": "I’m passionate about solving real-world problems through technology and continuous learning."
  },
  {
    "soru": "Do you prefer working independently or on a team?",
    "cevap": "I enjoy both. I’m self-motivated but also value the synergy of working in a team."
  },
  {
    "soru": "Can you tell me about yourself?",
    "cevap": "I am emre tosun. Look forward to work with you. Also I am very pacient and hardworking.",
    "rating": 0,
    "timestamp": "2025-05-24 14:23:15.692123"
  },
  {
    "soru": "Why do you want this job?",
    "cevap": "Idk",
    "rating": 0,
    "timestamp": "2025-05-25 18:15:16.685094"
  },
  {
    "soru": "What are your strengths?",
    "cevap": "a",
    "rating": 0,
    "timestamp": "2025-05-25 18:16:04.912494"
  },
  {
    "soru": "What are your weaknesses?",
    "cevap": "bv",
    "rating": 0,
    "timestamp": "2025-05-25 18:16:13.285360"
  },
  {
    "soru": "Why do you want this job?",
    "cevap": "q",
    "rating": 0,
    "timestamp": "2025-05-25 18:16:15.120377"
  },
  {
    "soru": "Can you tell me about yourself?",
    "cevap": "no",
    "rating": 0,
    "timestamp": "2025-05-25 18:16:19.639019"
  },
  {
    "soru": "Where do you see yourself in 5 years?",
    "cevap": "fuck off",
    "rating": 0,
    "timestamp": "2025-05-25 18:16:23.615113"
  }
]